#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-pos-tech/product-service/runs/run-RQdvsteT9hWcBW7m

Waiting for the plan to start...

Terraform v1.7.1
on linux_amd64
Initializing plugins and modules...
data.aws_security_group.vpc_endpoint_sm_cl: Refreshing...
data.aws_ecs_cluster.cluster: Refreshing...
data.aws_secretsmanager_secret.database_admin_secret: Refreshing...
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refreshing...
data.aws_vpc.main: Refreshing...
data.aws_apigatewayv2_api.tech_challenge_api: Refreshing...
data.aws_ecs_cluster.cluster: Refresh complete after 0s [id=arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge]
data.aws_secretsmanager_secret.database_admin_secret: Refresh complete after 0s [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Admin/Password-EvvaCX]
data.aws_secretsmanager_secret_version.database_admin_secret_version: Refreshing...
data.aws_security_group.vpc_endpoint_sm_cl: Refresh complete after 0s [id=sg-0e2dc7c7e10243507]
data.aws_secretsmanager_secret_version.database_admin_secret_version: Refresh complete after 0s [id=arn:aws:secretsmanager:us-east-1:598135944514:secret:database/Admin/Password-EvvaCX|AWSCURRENT]
data.aws_apigatewayv2_api.tech_challenge_api: Refresh complete after 0s [id=5am5sutwt1]
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refresh complete after 0s [id=9sezcf]
data.aws_vpc.main: Refresh complete after 0s [id=vpc-0c5a69114563ca731]
data.aws_subnets.private_subnet_ids: Refreshing...
data.aws_subnets.database_subnet_ids: Refreshing...
data.aws_subnets.database_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnets.private_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refreshing...
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refreshing...
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refreshing...
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refreshing...
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refreshing...
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refresh complete after 0s [id=subnet-03ac578c469316b7b]
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refresh complete after 0s [id=subnet-00f22e8c798c2dc4f]
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refresh complete after 0s [id=subnet-0f6198953ee43af96]
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refresh complete after 0s [id=subnet-04fba355f9c419a79]
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refresh complete after 0s [id=subnet-0fe0ac5ee5dfc62a8]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "database_admin_password"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-RQdvsteT9hWcBW7m/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-RQdvsteT9hWcBW7m/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.apigw_integration will be created
  + resource "aws_apigatewayv2_integration" "apigw_integration" {
      + api_id                                    = "5am5sutwt1"
      + connection_id                             = "9sezcf"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route_to_all_internal will be created
  + resource "aws_apigatewayv2_route" "apigw_route_to_all_internal" {
      + api_id             = "5am5sutwt1"
      + api_key_required   = false
      + authorization_type = "CUSTOM"
      + authorizer_id      = "cfoofd"
      + id                 = (known after apply)
      + route_key          = "ANY /product/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route_to_root will be created
  + resource "aws_apigatewayv2_route" "apigw_route_to_root" {
      + api_id             = "5am5sutwt1"
      + api_key_required   = false
      + authorization_type = "CUSTOM"
      + authorizer_id      = "cfoofd"
      + id                 = (known after apply)
      + route_key          = "ANY /product"
      + target             = (known after apply)
    }

  # aws_cloudwatch_log_group.service_log_group will be created
  + resource "aws_cloudwatch_log_group" "service_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/product-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "name" = "/ecs/product-service"
        }
      + tags_all          = {
          + "name"     = "/ecs/product-service"
          + "workload" = "product-service"
        }
    }

  # aws_db_instance.tech_challenge_db will be created
  + resource "aws_db_instance" "tech_challenge_db" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.34"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "product-service-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql8.0"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "workload" = "product-service"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.tech_challenge_rds_subnet_group will be created
  + resource "aws_db_subnet_group" "tech_challenge_rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "product-service-rds-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-00f22e8c798c2dc4f",
          + "subnet-0fe0ac5ee5dfc62a8",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "product-service-rds-subnet-group"
        }
      + tags_all                = {
          + "Name"     = "product-service-rds-subnet-group"
          + "workload" = "product-service"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 120
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "product-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "workload" = "product-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "product-service-container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-03ac578c469316b7b",
              + "subnet-04fba355f9c419a79",
              + "subnet-0f6198953ee43af96",
            ]
        }
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "tsk-product-service"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "workload" = "product-service"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.service_execution_role will be created
  + resource "aws_iam_role" "service_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "01"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "product_service_service_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "workload" = "product-service"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.service_execution_policy will be created
  + resource "aws_iam_role_policy" "service_execution_policy" {
      + id          = (known after apply)
      + name        = "product_service_service_execution_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "product-service-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-03ac578c469316b7b",
          + "subnet-04fba355f9c419a79",
          + "subnet-0f6198953ee43af96",
        ]
      + tags                                                         = {
          + "name" = "product-service-alb"
        }
      + tags_all                                                     = {
          + "name"     = "product-service-alb"
          + "workload" = "product-service"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.listener_http will be created
  + resource "aws_lb_listener" "listener_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "workload" = "product-service"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "product-service-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "workload" = "product-service"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0c5a69114563ca731"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/monitor/health"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 10
        }
    }

  # aws_secretsmanager_secret.app_database_password_secret will be created
  + resource "aws_secretsmanager_secret" "app_database_password_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "database/Service/Product/Password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "workload" = "product-service"
        }
    }

  # aws_secretsmanager_secret.database_credential will be created
  + resource "aws_secretsmanager_secret" "database_credential" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "service/Product/Database/Credential"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "workload" = "product-service"
        }
    }

  # aws_secretsmanager_secret_version.app_database_password_version will be created
  + resource "aws_secretsmanager_secret_version" "app_database_password_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.signer_version will be created
  + resource "aws_secretsmanager_secret_version" "signer_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "product-service alb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-product-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "alb-product-service-sg"
        }
      + tags_all               = {
          + "Name"     = "alb-product-service-sg"
          + "workload" = "product-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow connection from all world"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
          + {
              + cidr_blocks      = [
                  + "172.30.7.0/24",
                  + "172.30.8.0/24",
                ]
              + description      = "allow connection from database subnet"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = "allow connection from ecs"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "rds_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "workload" = "product-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group.service_sg will be created
  + resource "aws_security_group" "service_sg" {
      + arn                    = (known after apply)
      + description            = "product-service security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow Request From Target Group"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "product-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "product-service-sg"
        }
      + tags_all               = {
          + "Name"     = "product-service-sg"
          + "workload" = "product-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group_rule.ecs_to_vpc_endpoints will be created
  + resource "aws_security_group_rule" "ecs_to_vpc_endpoints" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e2dc7c7e10243507"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # mysql_database.service_database will be created
  + resource "mysql_database" "service_database" {
      + default_character_set = "utf8mb4"
      + default_collation     = "utf8mb4_0900_ai_ci"
      + id                    = (known after apply)
      + name                  = "product"
    }

  # mysql_grant.service_user_grant will be created
  + resource "mysql_grant" "service_user_grant" {
      + database   = "product"
      + grant      = false
      + host       = "%"
      + id         = (known after apply)
      + privileges = [
          + "ALL PRIVILEGES",
        ]
      + table      = "*"
      + tls_option = "NONE"
      + user       = "sys_product"
    }

  # mysql_user.service_user will be created
  + resource "mysql_user" "service_user" {
      + host               = "%"
      + id                 = (known after apply)
      + plaintext_password = (sensitive value)
      + tls_option         = "NONE"
      + user               = "sys_product"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @eberson, Action: `pull_request`*